# ApplicationClosing Event

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..ApplicationClosing Event
UIApplication Class See Also
---
Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public event EventHandler<ApplicationClosingEventArgs> ApplicationClosing
```

Visual Basic
---
```text
Public Event ApplicationClosing As EventHandler(Of ApplicationClosingEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ApplicationClosingEventArgs^>^ ApplicationClosing {
	void add (EventHandler<ApplicationClosingEventArgs^>^ value);
	void remove (EventHandler<ApplicationClosingEventArgs^>^ value);
}
```

# Remarks
This event is raised when the Revit application is just about to be closed.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
No document may be modified at the time of the event.
The sender object of this event is UIControlledApplication object.
# See Also
UIApplication Class
Autodesk.Revit.UI Namespace